---
title: FBXExportOptions
classe: Autodesk.Revit.DB.FBXExportOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# FBXExportOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 LevelsOfDetailValue { get; set; }` | `fBXExportOptions.LevelsOfDetailValue` | Int32 |
| `Boolean StopOnError { get; set; }` | `fBXExportOptions.StopOnError` | Boolean |
| `Boolean UseLevelsOfDetail { get; set; }` | `fBXExportOptions.UseLevelsOfDetail` | Boolean |
| `Boolean WithoutBoundaryEdges { get; set; }` | `fBXExportOptions.WithoutBoundaryEdges` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```